# ZCenter

## Description
Returns the z-coordinate value of the center of an object matching the search criteria

```pascal
FUNCTION ZCenter(c : CRITERIA) : REAL;
```

```python

def vs.ZCenter(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
```diff
- ZCenter is obsolete as of Vectorworks 2012
```

Availability: from Vectorworks 2009
## Category
* Criteria